// Запитати користувача рік його народження

// Запитати в якому місті він живе

// Запитати його улюблений вид спорта

// При натисканні на ОК, відображаємо в alert чи console.log наступну інформацію:
//    - Його вік
//    - Якщо користувач живе у Києві, Вашингтоні чи Лондоні - додати до повідомлення - “Ти живеш у столиці …” і на місце
//    крапок підставити назву країни, чию столицю він ввів. Інакше пишемо “Ти живеш в місті …” і на місце крапок –
//    введене місто.
//    - Обираємо самі три вида спорту та трьох чемпіонів з цих спортів. Відповідно, якщо користувач введе
//    один з цих видів спорту, то відображаємо йому повідомлення “Круто! Хочеш стати …?” і підставляємо на місце крапок
//    ім’я та прізвище чемпіона. Інакше просто виводимо “Твій улюблений вид спорта …” і пишемо те що обрав користувач.

// Якщо на будь-яке з питань користувач не захоче вводити дані й натисне “Cancel”, відобразити йому повідомлення
// “Шкода, що ви не захотіли ввести свій …” і вказуємо що саме він не захотів вводити - рік народження, місто чи вид
// спорту

const userBirthYear = prompt("Enter your year of birth");
const userCity = prompt("Enter the city you live in");
const userSport = prompt("Enter your favorite sport");

const calculatedAge = new Date().getFullYear() - userBirthYear;
// console.log(`Вік: ${calculateAge}.`);
console.log(userBirthYear === null ? "Шкода, що ви не захотіли ввести свій рік народження" : `Вік: ${calculatedAge}.`);

let cityOutput = "Ти живеш у столиці ";

switch (userCity) {
  case null:
    cityOutput = "Шкода, що ви не захотіли ввести своє місто";
    break;
  case "Київ":
    cityOutput += "України";
    break;
  case "Вашингтон":
    cityOutput += "США";
    break;
  case "Лондон":
    cityOutput += "Англії";
    break;
  default:
    cityOutput = `Ти живеш в місті ${userCity}`;
}

console.log(cityOutput);

switch (userSport) {
  case null:
    console.log("Шкода, що ви не захотіли ввести улюблений вид спорта");
    break;
  case "Футбол":
    console.log("Круто! Хочеш стати як Роберт Левандовский");
    break;
  case "Волейбол":
    console.log("Круто! Хочеш стати як Антуан Бризар");
    break;
  case "Плавання":
    console.log("Круто! Хочеш стати як Леон Маршан");
    break;
  default:
    console.log(`Твій улюблений вид спорта ${userSport}`);
}




